Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTag.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTag.AbbreviationTag
The abbreviation tag value.
Since:
2016

Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTag.TypeTag
The abbreviation tag type.
Since:
2016

Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTag.#ctor(Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTagType,System.String)
Constructs a new ReinforcementAbbreviationTag.
typeTag:
Defines the type of abbreviation tag.
abbreviationTag:
Defines the abbreviation tag value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTag
This class is used to access the Area or Path Reinforcement abbreviation tag data.
It stores abbreviation tag value and abbreviation type.
Since:
2016